; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_3 ?v1 - type_3 ?v5 - type_1)
 	      (pred_1 ?v2 - object ?v5 - type_1)
	      (pred_4 ?v1 - type_3 ?v3 - type_2)
	      (pred_2 ?v1 - type_3 ?v2 - object ?v3 - type_2))

   (:action op_3
       :parameters  (?v1 - type_3 ?v4 ?v7 - type_1)
       :precondition (and  (pred_3 ?v1 ?v4))
       :effect (and  (pred_3 ?v1 ?v7)
		     (not (pred_3 ?v1 ?v4))))

   (:action op_1
       :parameters (?v1 - type_3 ?v6 - object ?v8 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_1 ?v6 ?v8) (pred_3 ?v1 ?v8) (pred_4 ?v1 ?v3))
       :effect (and (pred_2 ?v1 ?v6 ?v3)
		    (not (pred_1 ?v6 ?v8)) 
		    (not (pred_4 ?v1 ?v3))))

   (:action op_2
       :parameters (?v1 - type_3 ?v6 - object ?v8 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_2 ?v1 ?v6 ?v3) (pred_3 ?v1 ?v8))
       :effect (and (pred_1 ?v6 ?v8)
		    (pred_4 ?v1 ?v3)
		    (not (pred_2 ?v1 ?v6 ?v3)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_07 obj_06 - type_3
obj_12 obj_09 obj_05 obj_13 - type_2
obj_04 obj_14 obj_08 obj_02 - type_1
obj_11 obj_03 obj_10 obj_01 - object)
(:init
(pred_3 obj_07 obj_04)
(pred_4 obj_07 obj_12)
(pred_4 obj_07 obj_09)
(pred_3 obj_06 obj_14)
(pred_4 obj_06 obj_05)
(pred_4 obj_06 obj_13)
(pred_1 obj_11 obj_08)
(pred_1 obj_03 obj_04)
(pred_1 obj_10 obj_08)
(pred_1 obj_01 obj_02)
)
(:goal
(and
(pred_1 obj_11 obj_14)
(pred_1 obj_03 obj_04)
(pred_1 obj_10 obj_08)
(pred_1 obj_01 obj_08)
)
)

(:constraints
  (always (not (pred_3 obj_07 obj_08)))
)
)

; plan
1. (op_3 obj_07 obj_04 obj_02)
   deleted: (pred_3 obj_07 obj_04)
   added: (pred_3 obj_07 obj_02)
   goals met: 2 of 4
2. (op_3 obj_06 obj_14 obj_08)
   deleted: (pred_3 obj_06 obj_14)
   added: (pred_3 obj_06 obj_08)
   goals met: 2 of 4
3. (op_1 obj_07 obj_01 obj_02 obj_09)
   deleted: (pred_1 obj_01 obj_02) (pred_4 obj_07 obj_09)
   added: (pred_2 obj_07 obj_01 obj_09)
   goals met: 2 of 4
4. (op_1 obj_06 obj_11 obj_08 obj_13)
   deleted: (pred_1 obj_11 obj_08) (pred_4 obj_06 obj_13)
   added: (pred_2 obj_06 obj_11 obj_13)
   goals met: 2 of 4
5. (op_3 obj_06 obj_08 obj_14)
   deleted: (pred_3 obj_06 obj_08)
   added: (pred_3 obj_06 obj_14)
   goals met: 2 of 4
6. (op_2 obj_07 obj_01 obj_02 obj_09)
   deleted: (pred_2 obj_07 obj_01 obj_09)
   added: (pred_1 obj_01 obj_02) (pred_4 obj_07 obj_09)
   goals met: 2 of 4
7. (op_2 obj_06 obj_11 obj_14 obj_13)
   deleted: (pred_2 obj_06 obj_11 obj_13)
   added: (pred_1 obj_11 obj_14) (pred_4 obj_06 obj_13)
   goals met: 3 of 4
8. (op_3 obj_06 obj_14 obj_02)
   deleted: (pred_3 obj_06 obj_14)
   added: (pred_3 obj_06 obj_02)
   goals met: 3 of 4
9. (op_1 obj_06 obj_01 obj_02 obj_13)
   deleted: (pred_1 obj_01 obj_02) (pred_4 obj_06 obj_13)
   added: (pred_2 obj_06 obj_01 obj_13)
   goals met: 3 of 4
10. (op_3 obj_06 obj_02 obj_08)
   deleted: (pred_3 obj_06 obj_02)
   added: (pred_3 obj_06 obj_08)
   goals met: 3 of 4
11. (op_2 obj_06 obj_01 obj_08 obj_13)
   deleted: (pred_2 obj_06 obj_01 obj_13)
   added: (pred_1 obj_01 obj_08) (pred_4 obj_06 obj_13)
   goals met: 4 of 4
